"""
1) Реализовать класс который бы производил разные операции над 2мя переданными числами.

Пример Использования:

proccess_input = ProcessInput(a=20, b=10)
print(proccess_input.add()). # выведет 30
print(proccess_input.subtract()). # выведет 10
print(proccess_input.multiple()). # выведет 200
print(proccess_input.divide()). # выведет 2
"""