"""
# Задача-1
# У вас есть список(list) IP адрессов. Вам необходимо создать
# класс который будет иметь методы:
# 1) Получить список IP адресов в развернутом виде
# (пример 10.11.12.13 -> 13.12.11.10)
# 2) Получить список IP адресов без первых октетов
# (пример 0.11.12.13 -> 11.12.13)
# 3) Получить список последних октетов IP адресов
# (пример 10.11.12.13 -> 13)

Пример инициализации класса
ip_adresses = ["10.11.12.13", "10.11.12.14", "10.11.12.15"]
ip_proccessing = IpProccessing(ip_adresses)

# Задача-2
# Вам необходимо написать
# класс который будет описывать работу с файлами, а
# именно:
# 1) Запись данных в файл
# 2) Чтение данных из файла
# 3) Удаление данных из файла

Пример
files_processing = FilesProccessing(file_path, mode)
"""
